# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Thomas\Documents\PSoC Creator\TASBot\TASBot.cydsn\TASBot.cyprj
# Date: Sun, 16 Oct 2016 13:16:39 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 16.666666666666664 -waveform {0 8.33333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 16.666666666666664 -waveform {0 8.33333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ConsolePort_2_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 11} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ConsolePort_1_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 11} [list [get_pins {ClockBlock/dclk_glb_1}]]


# Component constraints for C:\Users\Thomas\Documents\PSoC Creator\TASBot\TASBot.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Thomas\Documents\PSoC Creator\TASBot\TASBot.cydsn\TASBot.cyprj
# Date: Sun, 16 Oct 2016 13:16:32 GMT
